[
    "Vysvetlite rozdiel medzi HTTP a HTTPS?",
    "Čo je to REST API?",
    "Aký je rozdiel medzi let, const a var v JavaScripte?",
    "Čo je to DOM a ako s ním pracuje JavaScript?",
    "Aký je rozdiel medzi CSS a HTML?",
    "Čo je to JSON?",
    "Prečo sa heslá hashujú? A čo je to salt?",
    "Aký je rozdiel medzi HTTP a HTTPS?",
    "Načo je dobré asynchrónne programovanie pri webových aplikáciách?",
    "Aké HTTP metódy existujú a na čo sa používajú?",
    "Čo je to MVC?",
    "Čo sú to cookies a na čo sa používajú?",
    "Čo je to SQL injekcia?",
    "Čo je to XSS útok?",
    "Čo je to CSRF útok?",
    "Aké sú výhody a nevýhody webových aplikácií oproti desktopovým?",
    "Čo je to responzívna webová aplikácia?",
    "Čo znamená 'kaskádové' v názve CSS?",
    "Čo je to ORM?",
    "Uveďte 5 vlastností jazyka JavaScript.",
    "Aký je rozdiel medzi DOM a BOM?",
    "Čo je URL a z akých častí sa skladá?",
    "Aký je rozdiel medzi blokovými a riadkovými (inline) elementmi?",
    "Vysvetlite, ako funguje komunikácia medzi webovým klientom a serverom.",
    "Vysvetlite princíp API-first prístupu pri vývoji webu.",
    "Vysvetlite rozdiel medzi frontendovou a backendovou architektúrou aplikácie.",
    "Aký je rozdiel medzi cookies a sessions?",
    "Prečo je dôležité používať sémantické značky z pohľadu prístupnosti?",
    "Čo je sanitizácia a validácia vstupov?",
    "Aké sú najčastejšie bezpečnostné hrozby vo webových aplikáciách?",
    "Čo je to AJAX a na čo sa používa?",
    "Ako funguje autentifikácia založená na JWT?",
    "Prečo sa má validovať používateľský vstup?",
    "Čo je to endpoint?",
    "Ako prebieha proces načítania stránky od zadania URL až po jej zobrazenie v prehliadači?",
    "Prečo je HTTP považovaný za bezstavový protokol?",
    "Aký je rozdiel medzi GET a POST z pohľadu bezpečnosti a použitia?",
    "Čo umožňuje webovej aplikácii fungovať nezávisle od operačného systému používateľa?",
    "Prečo webová aplikácia potrebuje webový server a čo by sa stalo bez neho?",
    "Čo je to WebSocket?"
]
